DataProcessors/ЛБ_АвторизацияВЛомбарде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_АвторизацияВЛомбарде</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ТекущийЛомбардПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТекущийЛомбардПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПротоколРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПротоколРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДействияПользователя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ДействияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ДействияПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЛБ_АвторизацияВЛомбарде/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ Пользователь.ЭтоЛомбард Тогда
		УстановитьПараметрСеанса(Пользователь.Сотрудник); 
		Отказ = Истина;
	КонецЕсли;
	
	Ломбард = Пользователь.Подразделение; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	               |			,
	               |			Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = &Ломбард";
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отделение = Выборка.Отделение; 
		ОтделениеПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры



Функция СформироватьСписокСотрудников()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	               |			,
	               |			Отделение = &Отделение
	               |				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("Отделение", Отделение);

	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка");
	
				   
	
	Запрос2 = Новый Запрос;

	Запрос2.Текст = "ВЫБРАТЬ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	                |ИЗ
	                |	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	                |ГДЕ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	                |	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЛомбарда";
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	
	тзСотр = Запрос2.Выполнить().Выгрузить();
	
	Возврат тзСотр;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	// вставить проверку соответствия пароля и сотрудника 
	ОчиститьСообщения();
	Если БезОшибок() Тогда
		ПарольВерный = Истина;
		ЗаписатьВПротоколРаботы();
		УстановитьПараметрСеанса(Сотрудник);
		УстановитьПараметрСеансаЛомбард(Ломбард); 
		ЗаписатьТекущийЛомбардВРегистр();
		Закрыть();
			
		//+++ МоисеевЕС 20250512 меняем заголовок системы - указываем текущего пользователя плюсом
		УстановитьЗаголовокПриложения("" + ЭтотОбъект.Сотрудник + " " + КлиентскоеПриложение.ПолучитьЗаголовок());
		//--- МоисеевЕС 20250512
		
		//+МАН 18.03.26 Заявка 3750
		ОткрытьФорму("ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда");
		//-МАН
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьТекущийЛомбардВРегистр()
	МенеджерЗаписи = РегистрыСведений.ЛБ_ТекущийЛомбардПользователя.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Ломбард      = Ломбард;
	МенеджерЗаписи.Записать();	
КонецПроцедуры
	
	

Функция БезОшибок()  
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		Сообщить("Выберите сотрудника");
		Возврат Ложь;
	КонецЕсли;  
	Если СокрЛП(Пароль) = "" Тогда
		Сообщить("Неверный пароль");
		Возврат Ложь;		
	КонецЕсли;
	Если СокрЛП(Пароль) <> СокрЛП(Сотрудник.Пароль) Тогда 
		Сообщить("Пароль неверный");
		Возврат Ложь;	
	Иначе
		Возврат Истина;
    КонецЕсли;		
	
	//Запрос = Новый Запрос;
	//Запрос.Текст ="ВЫБРАТЬ
	//              |	ЛБ_ПаролиСотрудников.Пароль КАК Пароль
	//              |ИЗ
	//              |	РегистрСведений.ЛБ_ПаролиСотрудников КАК ЛБ_ПаролиСотрудников
	//              |ГДЕ
	//              |	ЛБ_ПаролиСотрудников.Сотрудник = &Сотрудник";
	//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если СокрЛП(Пароль) = СокрЛП(Выборка.Пароль) Тогда
	//		Возврат Истина;
	//	КонецЕсли;		 
	//КонецЦикла;
	//
	Возврат Ложь;
	
КонецФункции


Процедура ЗаписатьВПротоколРаботы()
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		МенеджерЗаписи = РегистрыСведений.ЛБ_ПротоколРаботы.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Сотрудник = Сотрудник; 
		МенеджерЗаписи.Дата = ТекущаяДата(); 
		МенеджерЗаписи.Ломбард = Ломбард; 
		МенеджерЗаписи.Действие = Перечисления.ЛБ_ДействияПользователя.Вход;
		МенеджерЗаписи.Записать(); 		
	КонецЕсли;	
КонецПроцедуры 

Процедура УстановитьПараметрСеанса(ТекСотр)
	ПараметрыСеанса.ТекущийСотрудник = ТекСотр;
КонецПроцедуры

Процедура УстановитьПараметрСеансаЛомбард(ТекЛомб)
	ПараметрыСеанса.ТекущийЛомбард = ТекЛомб;	
КонецПроцедуры


&НаСервере
Процедура ОтделениеПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	тзСотр = СформироватьСписокСотрудников(); 
	Для каждого стр из тзСотр Цикл
		Элементы.Сотрудник.СписокВыбора.Добавить(стр.Сотрудник, СокрЛП(стр.Сотрудник) + " ("+СокрЛП(стр.Должность)+")");
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОтделениеПриИзменении(Элемент)
	ОтделениеПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)   
	ОчиститьСообщения();
	Если НЕ БезОшибок() Тогда
		Отказ = Истина;
	КонецЕсли;
		//ЗавершениеРаботы = Истина;
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Закрыть1С(Команда)
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры
